hdscmcu/hc32f120/DeviceDriverLibrary/hc32f120_ddl/driver/src/hc32f120_interrupts.c
/**
 *******************************************************************************
 * @file  hc32f120_interrupts.c
 * @brief This file provides firmware functions to manage the Interrupt Controller
 *        (INTC).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2019-04-22       Zhangxl         First version
   2019-10-17       Zhangxl         Correct EIRQCRx address calculate formula;
                                    LVD judgment in IRQHandler31;
   2020-01-22       Zhangxl         Modify exclusive IRQ request process for 
                                    share handler
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f120_interrupts.h"
#include "hc32f120_utility.h"

/**
 * @addtogroup HC32F120_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_INTERRUPTS INTERRUPTS
 * @brief INTC Driver Library
 * @{
 */

#if (DDL_INTERRUPTS_ENABLE == DDL_ON) || (DDL_EXINT_NMI_ENABLE == DDL_ON) ||    \
    (DDL_EKEY_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup INTC_Local_Macros INTC Local Macros
 * @{
 */
/**
 * @brief   Maximum IRQ handler number
 */
#define IRQ_NUM_MAX         (16u)

/**
 * @defgroup INTC_Check_Parameters_Validity INTC Check Parameters Validity
 * @{
 */
/*  Parameter validity check for wakeup source from stop mode. */
#define IS_INTC_WKUP_SRC(src)                                                   \
(   ((src) & (INTC_WUPENR_EIRQWUEN          | INTC_WUPENR_SWDTWUEN      |       \
                 INTC_WUPENR_EKEYWUEN       | INTC_WUPENR_TMR0CMPWUEN   |       \
                 INTC_WUPENR_PVDWUEN        | INTC_WUPENR_RTCALMWUEN    |       \
                 INTC_WUPENR_RTCPRDWUEN))   != (uint32_t)0x00000000ul)

/*  Parameter validity check for event number. */
#define IS_INTC_EVENT(event)                                                    \
(   ((event) & (INTC_EVTER_EVTEN0   | INTC_EVTER_EVTEN1                 |       \
                INTC_EVTER_EVTEN2   | INTC_EVTER_EVTEN3                 |       \
                INTC_EVTER_EVTEN4   | INTC_EVTER_EVTEN5                 |       \
                INTC_EVTER_EVTEN6   | INTC_EVTER_EVTEN7)) != (uint8_t)0x00u)

/*  Parameter validity check for NMI pin filter function. */
#define IS_NMI_FE(fe)                                                           \
(   ((fe) == NMI_FILTER_OFF)                    ||                              \
    ((fe) == NMI_FILTER_ON))

/*  Parameter validity check for MNI pin filter clock division. */
#define IS_NMI_FCLK(fclk)                                                       \
(   ((fclk) == NMI_FCLK_HCLK_DIV1)              ||                              \
    ((fclk) == NMI_FCLK_HCLK_DIV8)              ||                              \
    ((fclk) == NMI_FCLK_HCLK_DIV32)             ||                              \
    ((fclk) == NMI_FCLK_HCLK_DIV64))

/*  Parameter validity check for NMI pin trigger edge. */
#define IS_NMI_TRIGGER(trigger)                                                 \
(   ((trigger) == NMI_TRIGGER_FALLING)          ||                              \
    ((trigger) == NMI_TRIGGER_RISING))

/*  Parameter validity check for NMI trigger souce. */
#define IS_NMI_SRC(src) (((src) & NMI_SRC_MASK) != (uint8_t)0x00u)

/*  Parameter validity check for get NMI trigger source. */
#define IS_GET_NMI_SRC(src)                                                     \
(   ((src) == NMI_SRC_NMI_PIN)                  ||                              \
    ((src) == NMI_SRC_XTAL_STP)                 ||                              \
    ((src) == NMI_SRC_SWDT)                     ||                              \
    ((src) == NMI_SRC_LVD))

/*  Parameter validity check for EXINT filter function. */
#define IS_EXINT_FE(fe)                                                         \
(   ((fe) == EXINT_FILTER_OFF)                  ||                              \
    ((fe) == EXINT_FILTER_ON))

/*  Parameter validity check for EXINT filter clock division. */
#define IS_EXINT_FCLK(fclk)                                                     \
(   ((fclk) == EXINT_FCLK_HCLK_DIV1)            ||                              \
    ((fclk) == EXINT_FCLK_HCLK_DIV8)            ||                              \
    ((fclk) == EXINT_FCLK_HCLK_DIV32)           ||                              \
    ((fclk) == EXINT_FCLK_HCLK_DIV64))

/*  Parameter validity check for EXINT trigger edge. */
#define IS_EXINT_TRIGGER(trigger)                                               \
(   ((trigger) == EXINT_TRIGGER_LOW)            ||                              \
    ((trigger) == EXINT_TRIGGER_RISING)         ||                              \
    ((trigger) == EXINT_TRIGGER_FALLING)        ||                              \
    ((trigger) == EXINT_TRIGGER_BOTH))

/*  Parameter validity check for EXINT channel. */
#define IS_EXINT_CH(ch)     (((ch) & EXINT_CH_MASK) != (uint16_t)0x0000u)

/*  Parameter validity check for get EXINT channel. */
#define IS_GET_EXINT_CH(ch)                                                     \
(   ((ch) == EXINT_CH00)                        ||                              \
    ((ch) == EXINT_CH01)                        ||                              \
    ((ch) == EXINT_CH02)                        ||                              \
    ((ch) == EXINT_CH03)                        ||                              \
    ((ch) == EXINT_CH04)                        ||                              \
    ((ch) == EXINT_CH05)                        ||                              \
    ((ch) == EXINT_CH06)                        ||                              \
    ((ch) == EXINT_CH07)                        ||                              \
    ((ch) == EXINT_CH08)                        ||                              \
    ((ch) == EXINT_CH09))

/*  Parameter validity check for EKEY. */
#define IS_INTC_EKEY(ekey)  (((ekey) & INTC_EKEY_MASK) != (uint8_t)0x00u)
/**
 * @}
 */

/**
 * @}
 */

