hdscmcu/hc32f120/DeviceDriverLibrary/hc32f120_ddl/driver/src/hc32f120_interrupts.c
    /* Check if pointer is NULL */
    if (NULL == pstcNmiConfig)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configure to default value */
        pstcNmiConfig->u8NmiFE          = NMI_FILTER_OFF;
        pstcNmiConfig->u8NmiFClk        = NMI_FCLK_HCLK_DIV1;
        pstcNmiConfig->u8NmiTigger      = NMI_TRIGGER_FALLING;
        pstcNmiConfig->u8NmiSrc         = NMI_SRC_NMI_PIN;
        pstcNmiConfig->pfnNmiCallback   = NULL;
    }
    return enRet;
}

/**
 * @brief  Initialize NMI.
 * @param  [in] pstcNmiConfig: Pointer to a pstcNmiConfig structure that
 *                             contains configuration information.
 * @retval Ok: NMI initialize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t NMI_Init(const stc_nmi_config_t *pstcNmiConfig)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if ((NULL == pstcNmiConfig) || (NULL == pstcNmiConfig->pfnNmiCallback))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Parameter validity checking */
        DDL_ASSERT(IS_NMI_FCLK(pstcNmiConfig->u8NmiFClk));
        DDL_ASSERT(IS_NMI_FE(pstcNmiConfig->u8NmiFE));
        DDL_ASSERT(IS_NMI_TRIGGER(pstcNmiConfig->u8NmiTigger));
        DDL_ASSERT(IS_NMI_SRC(pstcNmiConfig->u8NmiSrc));

        INTC_Unlock();

        /* NMI pin interrupt configure */
        WRITE_REG8(M0P_INTC->NMICR,                                             \
                  (pstcNmiConfig->u8NmiFE         |                             \
                   pstcNmiConfig->u8NmiFClk       |                             \
                   pstcNmiConfig->u8NmiTigger));

        /* Clear all NMI trigger source before set */
        WRITE_REG8(M0P_INTC->NMICLR, INTC_NMICLR_MASK);

        /* NMI trigger source configure */
        WRITE_REG8(M0P_INTC->NMIER, pstcNmiConfig->u8NmiSrc);

        /* NMI callback function configure */
        pfnNmiCallback = pstcNmiConfig->pfnNmiCallback;

        INTC_Lock();
    }
    return enRet;
}

/**
 * @brief  Get NMI trigger source
 * @param  [in] u8NmiSrc: NMI trigger source, @ref NMI_TriggerSrc_Sel for details
 *   @arg  NMI_SRC_NMI_PIN
 *   @arg  NMI_SRC_XTAL_STP
 *   @arg  NMI_SRC_SWDT
 *   @arg  NMI_SRC_LVD
 * @retval Set: NMI is triggered by corresponding source
 *         Reset: NMI is not triggered by corresponding source
 */
en_flag_status_t NMI_GetNmiSrc(uint8_t u8NmiSrc)
{
    /* Parameter validity checking */
    DDL_ASSERT(IS_GET_NMI_SRC(u8NmiSrc));

    return ((READ_REG8(M0P_INTC->NMIFR) & u8NmiSrc)) ? Set : Reset;
}

/**
 * @brief  Clear specified NMI trigger source
 * @param  [in] u8NmiSrc: NMI trigger source, @ref NMI_TriggerSrc_Sel for details
 *   @arg  NMI_SRC_NMI_PIN
 *   @arg  NMI_SRC_XTAL_STP
 *   @arg  NMI_SRC_SWDT
 *   @arg  NMI_SRC_LVD
 * @retval None
 */
void NMI_ClrNmiSrc(uint8_t u8NmiSrc)
{
    /* Parameter validity checking */
    DDL_ASSERT(IS_NMI_SRC(u8NmiSrc));

    INTC_Unlock();
    MODIFY_REG8(M0P_INTC->NMICLR, INTC_NMICLR_MASK, u8NmiSrc);
    INTC_Lock();
}

/**
 * @brief  NMI IRQ handler
 * @param  None
 * @retval None
 */
void NMI_IrqHandler(void)
{
    if (NULL != pfnNmiCallback)
    {
        pfnNmiCallback();
    }
}

/**
 * @brief  Initialize External interrupt.
 * @param  [in] pstcExIntConfig: Pointer to a pstcExIntConfig structure that
 *                             contains configuration information.
 * @retval Ok:  EXINT initialize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t EXINT_Init(const stc_exint_config_t *pstcExIntConfig)
{
    uint8_t u8ExIntPos = 0u;
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcExIntConfig)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Parameter validity checking */
        DDL_ASSERT(IS_EXINT_FE(pstcExIntConfig->u8ExIntFE));
        DDL_ASSERT(IS_EXINT_FCLK(pstcExIntConfig->u8ExIntFClk));
        DDL_ASSERT(IS_EXINT_TRIGGER(pstcExIntConfig->u8ExIntLvl));
        DDL_ASSERT(IS_EXINT_CH(pstcExIntConfig->u16ExIntCh));

        INTC_Unlock();
        for (u8ExIntPos = 0u; u8ExIntPos < 10u; u8ExIntPos++)
        {
            if (pstcExIntConfig->u16ExIntCh & (1ul << u8ExIntPos))
            {
                WRITE_REG8(*(uint8_t *)((uint32_t)(&M0P_INTC->EIRQCR0) + 4u*u8ExIntPos),\
                          (pstcExIntConfig->u8ExIntFE         |                         \
                           pstcExIntConfig->u8ExIntFClk       |                         \
                           pstcExIntConfig->u8ExIntLvl));
            }
        }
        INTC_Lock();
    }
    return enRet;
}

/**
 * @brief  Initialize ExInt. Fill each pstcExintConfig with default value
 * @param  [in] pstcExintConfig: Pointer to a pstcExintConfig structure
 *                              that contains configuration information.
 * @retval Ok: EXINT structure initialize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t EXINT_StructInit(stc_exint_config_t *pstcExintConfig)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcExintConfig)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configure to default value */
        pstcExintConfig->u16ExIntCh     = (uint16_t)0ul;
        pstcExintConfig->u8ExIntFE      = EXINT_FILTER_OFF;
        pstcExintConfig->u8ExIntFClk    = EXINT_FCLK_HCLK_DIV1;
        pstcExintConfig->u8ExIntLvl     = EXINT_TRIGGER_FALLING;
    }
    return enRet;
}

/**
 * @brief  Clear specified External interrupt trigger source
 * @param  [in] u16ExIntCh: External interrupt channel, @ref EXINT_Channel_Sel for details
 *   @arg  EXINT_CH00
 *   @arg  EXINT_CH01
 *   @arg  EXINT_CH02
 *   @arg  EXINT_CH03
 *   @arg  EXINT_CH04
 *   @arg  EXINT_CH05
 *   @arg  EXINT_CH06
 *   @arg  EXINT_CH07
 *   @arg  EXINT_CH08
 *   @arg  EXINT_CH09
 * @retval None
 */
void EXINT_ClrExIntSrc(uint16_t u16ExIntCh)
{
    /* Parameter validity checking */
    DDL_ASSERT(IS_EXINT_CH(u16ExIntCh));

    INTC_Unlock();
    SET_REG16_BIT(M0P_INTC->EIRQCLR, u16ExIntCh);
    INTC_Lock();
}

/**
 * @brief  Get specified External interrupt trigger source
 * @param  [in] u16ExIntCh: External interrupt channel, @ref EXINT_Channel_Sel for details
 *   @arg  EXINT_CH00
 *   @arg  EXINT_CH01
 *   @arg  EXINT_CH02
 *   @arg  EXINT_CH03
 *   @arg  EXINT_CH04
 *   @arg  EXINT_CH05
 *   @arg  EXINT_CH06
 *   @arg  EXINT_CH07
 *   @arg  EXINT_CH08
 *   @arg  EXINT_CH09
 * @retval Set: Specified channel of external interrupt is triggered
 *         Reset: Specified channel of external interrupt is not triggered
 */
en_flag_status_t EXINT_GetExIntSrc(uint16_t u16ExIntCh)
{
    /* Parameter validity checking */
    DDL_ASSERT(IS_EXINT_CH(u16ExIntCh));

    return (READ_REG16(M0P_INTC->EIRQFR) & u16ExIntCh) ? Set : Reset;
}

/**
 * @brief  Configure the specified EKEY
 * @param  [in] u8EKey: EKEY channel, @ref INTC_EKEY_Channel for details
 *   @arg  INTC_EKEY0
 *   @arg  INTC_EKEY1
 *   @arg  INTC_EKEY2
 *   @arg  INTC_EKEY3
 *   @arg  INTC_EKEY4
 *   @arg  INTC_EKEY5
 * @param  [in] enNewState
 *   @arg  Enable: Enable corresponding EKEY
 *   @arg  Disable: Disable corresponding EKEY
 * @retval None
 */
void INTC_EKeyCmd(uint8_t u8EKey, en_functional_state_t enNewState)
{
    /* Parameter validity checking */
    DDL_ASSERT(IS_INTC_EKEY(u8EKey));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    INTC_Unlock();
    if (Enable == enNewState)
    {
        SET_REG8_BIT(M0P_INTC->EKEYCR, u8EKey);
    }
    else
    {
        CLEAR_REG8_BIT(M0P_INTC->EKEYCR, u8EKey);
    }
    INTC_Lock();
}

/**
 * @brief  NMI IRQ handler
 * @param  None
 * @retval None
 */
void NMI_Handler(void)
{
    NMI_IrqHandler();
}

/**
 * @brief  Hard Fault IRQ handler
 * @param  None
 * @retval None
 */
void HardFault_Handler(void)
{
    HardFault_IrqHandler();
}

/**
 * @brief  SVCall IRQ handler
 * @param  None
 * @retval None
 */
void SVC_Handler(void)
{
    SVC_IrqHandler();
}

/**
 * @brief  PendSV IRQ handler
 * @param  None
 * @retval None
 */
void PendSV_Handler(void)
{
    PendSV_IrqHandler();
}

/**
 * @brief  SysTick IRQ handler
 * @param  None
 * @retval None
 */
void SysTick_Handler(void)
{
    SysTick_IrqHandler();
}

/**
 * @brief  Interrupt No.008 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ008_Handler(void)
{
    pfnIrqHandler[Int008_IRQn-8u]();
}

/**
 * @brief  Interrupt No.009 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ009_Handler(void)
{
    pfnIrqHandler[Int009_IRQn-8u]();
}

/**
 * @brief  Interrupt No.010 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ010_Handler(void)
{
    pfnIrqHandler[Int010_IRQn-8u]();
}


/**
 * @brief  Interrupt No.011 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ011_Handler(void)
{
    pfnIrqHandler[Int011_IRQn-8u]();
}

/**
 * @brief  Interrupt No.012 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ012_Handler(void)
{
    pfnIrqHandler[Int012_IRQn-8u]();
}

/**
 * @brief  Interrupt No.013 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ013_Handler(void)
{
    pfnIrqHandler[Int013_IRQn-8u]();
}

/**
 * @brief  Interrupt No.014 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ014_Handler(void)
{
    pfnIrqHandler[Int014_IRQn-8u]();
}

/**
 * @brief  Interrupt No.015 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ015_Handler(void)
{
    pfnIrqHandler[Int015_IRQn-8u]();
}

/**
 * @brief  Interrupt No.016 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ016_Handler(void)
{
    pfnIrqHandler[Int016_IRQn-8u]();
}

/**
 * @brief  Interrupt No.017 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ017_Handler(void)
{
    pfnIrqHandler[Int017_IRQn-8u]();
}

/**
 * @brief  Interrupt No.018 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ018_Handler(void)
{
    pfnIrqHandler[Int018_IRQn-8u]();
}

/**
 * @brief  Interrupt No.019 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ019_Handler(void)
{
    pfnIrqHandler[Int019_IRQn-8u]();
}

/**
 * @brief  Interrupt No.020 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ020_Handler(void)
{
    pfnIrqHandler[Int020_IRQn-8u]();
}

/**
 * @brief  Interrupt No.021 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ021_Handler(void)
{
    pfnIrqHandler[Int021_IRQn-8u]();
}

/**
 * @brief  Interrupt No.022 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ022_Handler(void)
{
    pfnIrqHandler[Int022_IRQn-8u]();
}

/**
 * @brief  Interrupt No.023 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ023_Handler(void)
{
    pfnIrqHandler[Int023_IRQn-8u]();
}

/**
 * @brief  Interrupt No.024 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ024_Handler(void)
{
    uint32_t u32Tmp1 = 0ul;
    uint32_t u32Tmp2 = 0ul;
    uint32_t ISELBR24 = M0P_INTC->ISELBR24;
    /* External interrupt 08 */
    u32Tmp1 = bM0P_INTC->EIRQFR_b.EIRQF8;
    if ((ISELBR24 & BIT_MASK_01) && (u32Tmp1))
    {
        Extint08_IrqHandler();
    }
    /* EFM program/erase error */
    if (bM0P_EFM->FITE_b.PEERRITE)
    {
        u32Tmp1 = M0P_EFM->FSR & (EFM_FSR_PEWERR | EFM_FSR_PEPRTERR | EFM_FSR_PGMISMTCH);
        if ((ISELBR24 & BIT_MASK_04) && (u32Tmp1))
        {
            EfmPgmEraseErr_IrqHandler();
        }
    }
    /* EFM read collision */
    if (bM0P_EFM->FITE_b.RDCOLERRITE)
    {
        u32Tmp1 = bM0P_EFM->FSR_b.RDCOLERR;
        if ((ISELBR24 & BIT_MASK_05) && (u32Tmp1))
        {
            EfmColErr_IrqHandler();
        }
    }
    /* XTAL stop */
    if (bM0P_CMU->XTALSTDCR_b.XTALSTDIE)
    {
        u32Tmp1 = bM0P_CMU->XTALSTDSR_b.XTALSTDF;
        if ((ISELBR24 & BIT_MASK_06) && (u32Tmp1))
        {
            XtalStop_IrqHandler();
        }
    }
    /* SWDT underflow or fresh error */
    u32Tmp1 = M0P_SWDT->SR & (SWDT_SR_UDF | SWDT_SR_REF);
    if ((ISELBR24 & BIT_MASK_07) &&  (u32Tmp1))
    {
        Swdt_IrqHandler();
    }
    /* TimerB7 overflow */
    u32Tmp1 = bM0P_TMRB7->BCSTR_b.OVFF;
    u32Tmp2 = bM0P_TMRB7->BCSTR_b.INENOVF;
    if ((ISELBR24 & BIT_MASK_08) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB7OF_IrqHandler();
    }
    /* TimerB7 underflow */
    u32Tmp1 = bM0P_TMRB7->BCSTR_b.UDFF;
    u32Tmp2 = bM0P_TMRB7->BCSTR_b.INENUDF;
    if ((ISELBR24 & BIT_MASK_09) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB7UF_IrqHandler();
    }
    /* TimerB8 compare match */
    u32Tmp1 = bM0P_TMRB8->STFLR_b.CMPF1;
    u32Tmp2 = bM0P_TMRB8->ICONR_b.ITEN1;
    if ((ISELBR24 & BIT_MASK_10) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB8Cmp_IrqHandler();
    }
    /* USART1 Rx ORE/FE/PE error */
    u32Tmp1 = M0P_USART1->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
    u32Tmp2 = bM0P_USART1->CR1_b.RIE;
    if ((ISELBR24 & BIT_MASK_12) && (u32Tmp1) && (u32Tmp2))
    {
        Usart1RxErr_IrqHandler();
    }
    /* I2c error */
    u32Tmp1 = M0P_I2C->SR & (I2C_SR_STARTF   | I2C_SR_SLADDR0F     |            \
                             I2C_SR_SLADDR1F | I2C_SR_STOPF        |            \
                             I2C_SR_ARLOF    | I2C_SR_NACKF        |            \
                             I2C_SR_GENCALLF | I2C_SR_SMBDEFAULTF  |            \
                             I2C_SR_SMBHOSTF | I2C_SR_SMBALRTF);

    u32Tmp2 = M0P_I2C->CR2& (I2C_CR2_STARTIE   | I2C_CR2_SLADDR0IE     |        \
                             I2C_CR2_SLADDR1IE | I2C_CR2_STOPIE        |        \
                             I2C_CR2_ARLOIE    | I2C_CR2_NACKIE        |        \
                             I2C_CR2_GENCALLIE | I2C_CR2_SMBDEFAULTIE  |        \
                             I2C_CR2_SMBHOSTIE | I2C_CR2_SMBALRTIE);
    if ((ISELBR24 & BIT_MASK_13) && (u32Tmp1 & u32Tmp2))
    {
        I2cErr_IrqHandler();
    }
    /* SPI parity/overflow/underflow/mode error */
    u32Tmp1 = M0P_SPI->SR & (SPI_SR_UDRERF | SPI_SR_PERF | SPI_SR_MODFERF | SPI_SR_OVRERF);
    u32Tmp2 = bM0P_SPI->CR1_b.EIE;
    if ((ISELBR24 & BIT_MASK_14) && (u32Tmp1) && (u32Tmp2))
    {
        SpiErr_IrqHandler();
    }
    /* USART4 Rx ORE/FE/PE error */
    u32Tmp1 = M0P_USART4->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
    u32Tmp2 = bM0P_USART4->CR1_b.RIE;
    if ((ISELBR24 & BIT_MASK_15) &&  (u32Tmp1) && (u32Tmp2))
    {
        Usart4RxErr_IrqHandler();
    }
}

/**
 * @brief  Interrupt No.025 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ025_Handler(void)
{
    uint32_t u32Tmp1 = 0ul;
    uint32_t u32Tmp2 = 0ul;
    uint32_t ISELBR25 = M0P_INTC->ISELBR25;

