hdscmcu/hc32f120/DeviceDriverLibrary/hc32f120_ddl/driver/src/hc32f120_interrupts.c
    /* External interrupt 09 */
    u32Tmp1 = bM0P_INTC->EIRQFR_b.EIRQF9;
    if ((ISELBR25 & BIT_MASK_01) && (u32Tmp1))
    {
        Extint09_IrqHandler();
    }
    /* Clock trimming error */
    u32Tmp1 = M0P_CTC->STR & (CTC_STR_TRMOVF | CTC_STR_TRMUDF);
    u32Tmp2 = bM0P_CTC->CR1_b.ERRIE;
    if ((ISELBR25 & BIT_MASK_04) && (u32Tmp1) && (u32Tmp2))
    {
        ClockTrimErr_IrqHandler();
    }
    /* TimerB8 overflow */
    u32Tmp1 = bM0P_TMRB8->BCSTR_b.OVFF;
    u32Tmp2 = bM0P_TMRB8->BCSTR_b.INENOVF;
    if ((ISELBR25 & BIT_MASK_08) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB8OF_IrqHandler();
    }
    /* TimerB8 underflow */
    u32Tmp1 = bM0P_TMRB8->BCSTR_b.UDFF;
    u32Tmp2 = bM0P_TMRB8->BCSTR_b.INENUDF;
    if ((ISELBR25 & BIT_MASK_09) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB8UF_IrqHandler();
    }
    /* TimerB7 compare match */
    u32Tmp1 = bM0P_TMRB7->STFLR_b.CMPF1;
    u32Tmp2 = bM0P_TMRB7->ICONR_b.ITEN1;
    if ((ISELBR25 & BIT_MASK_10) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB7Cmp_IrqHandler();
    }
    /* USART1 Rx end */
    u32Tmp1 = bM0P_USART1->SR_b.RXNE;
    u32Tmp2 = bM0P_USART1->CR1_b.RIE;
    if ((ISELBR25 & BIT_MASK_12) && (u32Tmp1) && (u32Tmp2))
    {
        Usart1RxEnd_IrqHandler();
    }
    /* USART4 Rx end */
    u32Tmp1 = bM0P_USART4->SR_b.RXNE;
    u32Tmp2 = bM0P_USART4->CR1_b.RIE;
    if ((ISELBR25 & BIT_MASK_15) && (u32Tmp1) && (u32Tmp2))
    {
        Usart4RxEnd_IrqHandler();
    }
}

/**
 * @brief  Interrupt No.026 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ026_Handler(void)
{
    uint32_t u32Tmp1 = 0ul;
    uint32_t u32Tmp2 = 0ul;
    uint32_t ISELBR26 = M0P_INTC->ISELBR26;
    /* TimerB5 overflow */
    u32Tmp1 = bM0P_TMRB5->BCSTR_b.OVFF;
    u32Tmp2 = bM0P_TMRB5->BCSTR_b.INENOVF;
    if ((ISELBR26 & BIT_MASK_08) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB5OF_IrqHandler();
    }
    /* TimerB5 underflow */
    u32Tmp1 = bM0P_TMRB5->BCSTR_b.UDFF;
    u32Tmp2 = bM0P_TMRB5->BCSTR_b.INENUDF;
    if ((ISELBR26 & BIT_MASK_09) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB5UF_IrqHandler();
    }
    /* TimerB6 compare match */
    u32Tmp1 = bM0P_TMRB6->STFLR_b.CMPF1;
    u32Tmp2 = bM0P_TMRB6->ICONR_b.ITEN1;
    if ((ISELBR26 & BIT_MASK_10) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB6Cmp_IrqHandler();
    }
    /* USART1 Tx buffer empty */
    u32Tmp1 = bM0P_USART1->SR_b.TXE;
    u32Tmp2 = bM0P_USART1->CR1_b.TXEIE;
    if ((ISELBR26 & BIT_MASK_12) && (u32Tmp1) && (u32Tmp2))
    {
        Usart1TxEmpt_IrqHandler();
    }
    /* USART3 Rx ORE/FE/PE error */
    u32Tmp1 = M0P_USART3->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
    u32Tmp2 = bM0P_USART3->CR1_b.RIE;
    if ((ISELBR26 & BIT_MASK_13) && (u32Tmp1) && (u32Tmp2))
    {
        Usart3RxErr_IrqHandler();
    }
}

/**
 * @brief  Interrupt No.027 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ027_Handler(void)
{
    uint32_t u32Tmp1 = 0ul;
    uint32_t u32Tmp2 = 0ul;
    uint32_t ISELBR27 = M0P_INTC->ISELBR27;

    /* EKEY and other Interrupt source are exclusive */
    if (BIT_MASK_01 == ISELBR27)
    {
        EKey_IrqHandler();
    }
    else
    {
        /* Timer 0 compare match */
        u32Tmp1 = bM0P_TMR0->STFLR_b.CMFA;
        u32Tmp2 = bM0P_TMR0->BCONR_b.INTENA;
        if ((ISELBR27 & BIT_MASK_02) && (u32Tmp1) && (u32Tmp2))
        {
            Timer0GCmp_IrqHandler();
        }
        /* TimerB6 overflow */
        u32Tmp1 = bM0P_TMRB6->BCSTR_b.OVFF;
        u32Tmp2 = bM0P_TMRB6->BCSTR_b.INENOVF;
        if ((ISELBR27 & BIT_MASK_08) && (u32Tmp1) && (u32Tmp2))
        {
            TimerB6OF_IrqHandler();
        }
        /* TimerB6 underflow */
        u32Tmp1 = bM0P_TMRB6->BCSTR_b.UDFF;
        u32Tmp2 = bM0P_TMRB6->BCSTR_b.INENUDF;
        if ((ISELBR27 & BIT_MASK_09) && (u32Tmp1) && (u32Tmp2))
        {
            TimerB6UF_IrqHandler();
        }
        /* TimerB5 compare match */
        u32Tmp1 = bM0P_TMRB5->STFLR_b.CMPF1;
        u32Tmp2 = bM0P_TMRB5->ICONR_b.ITEN1;
        if ((ISELBR27 & BIT_MASK_10) && (u32Tmp1) && (u32Tmp2))
        {
            TimerB5Cmp_IrqHandler();
        }
        /* USART1 Tx end */
        u32Tmp1 = bM0P_USART1->SR_b.TC;
        u32Tmp2 = bM0P_USART1->CR1_b.TCIE;
        if ((ISELBR27 & BIT_MASK_12) && (u32Tmp1) && (u32Tmp2))
        {
            Usart1TxEnd_IrqHandler();
        }
        /* USART3 Rx end */
        u32Tmp1 = bM0P_USART3->SR_b.RXNE;
        u32Tmp2 = bM0P_USART3->CR1_b.RIE;
        if ((ISELBR27 & BIT_MASK_13) && (u32Tmp1) && (u32Tmp2))
        {
            Usart3RxEnd_IrqHandler();
        }
        /* SPI Rx end */
        u32Tmp1 = bM0P_SPI->SR_b.RDFF;
        u32Tmp2 = bM0P_SPI->CR1_b.RXIE;
        if ((ISELBR27 & BIT_MASK_14) && (u32Tmp1) && (u32Tmp2))
        {
            SpiRxEnd_IrqHandler();
        }
    }
}

/**
 * @brief  Interrupt No.028 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ028_Handler(void)
{
    uint32_t u32Tmp1 = 0ul;
    uint32_t u32Tmp2 = 0ul;
    uint32_t ISELBR28 = M0P_INTC->ISELBR28;

    /* TimerB3 overflow */
    u32Tmp1 = bM0P_TMRB3->BCSTR_b.OVFF;
    u32Tmp2 = bM0P_TMRB3->BCSTR_b.INENOVF;
    if ((ISELBR28 & BIT_MASK_08) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB3OF_IrqHandler();
    }
    /* TimerB3 underflow */
    u32Tmp1 = bM0P_TMRB3->BCSTR_b.UDFF;
    u32Tmp2 = bM0P_TMRB3->BCSTR_b.INENUDF;
    if ((ISELBR28 & BIT_MASK_09) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB3UF_IrqHandler();
    }
    /* TimerB4 compare match */
    u32Tmp1 = bM0P_TMRB4->STFLR_b.CMPF1;
    u32Tmp2 = bM0P_TMRB4->ICONR_b.ITEN1;
    if ((ISELBR28 & BIT_MASK_10) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB4Cmp_IrqHandler();
    }
    /* ADC seq.A convert complete */
    u32Tmp1 = bM0P_ADC->ISR_b.EOCAF;
    u32Tmp2 = bM0P_ADC->ICR_b.EOCAIEN;
    if ((ISELBR28 & BIT_MASK_11) && (u32Tmp1) && (u32Tmp2))
    {
        AdcSeqA_IrqHandler();
    }
    /* USART2 Rx ORE/FE/PE error */
    u32Tmp1 = M0P_USART2->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
    u32Tmp2 = bM0P_USART2->CR1_b.RIE;
    if ((ISELBR28 & BIT_MASK_12) && (u32Tmp1) && (u32Tmp2))
    {
        Usart2RxErr_IrqHandler();
    }
    /* USART3 Tx buffer empty */
    u32Tmp1 = bM0P_USART3->SR_b.TXE;
    u32Tmp2 = bM0P_USART3->CR1_b.TXEIE;
    if ((ISELBR28 & BIT_MASK_13) && (u32Tmp1) && (u32Tmp2))
    {
        Usart3TxEmpt_IrqHandler();
    }
    /* I2c Tx buffer empty */
    u32Tmp1 = bM0P_I2C->SR_b.TEMPTYF;
    u32Tmp2 = bM0P_I2C->CR2_b.TEMPTYIE;
    if ((ISELBR28 & BIT_MASK_14) && (u32Tmp1) && (u32Tmp2))
    {
        I2cTxEmpt_IrqHandler();
    }
    /* SPI bus idle */
    u32Tmp1 = bM0P_SPI->SR_b.IDLNF;
    u32Tmp2 = bM0P_SPI->CR1_b.IDIE;
    if ((ISELBR28 & BIT_MASK_15) && (u32Tmp1) && (u32Tmp2))
    {
        SpiIdle_IrqHandler();
    }
}

/**
 * @brief  Interrupt No.029 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ029_Handler(void)
{
    uint32_t u32Tmp1 = 0ul;
    uint32_t u32Tmp2 = 0ul;
    uint32_t ISELBR29 = M0P_INTC->ISELBR29;

    /* TimerB4 overflow */
    u32Tmp1 = bM0P_TMRB4->BCSTR_b.OVFF;
    u32Tmp2 = bM0P_TMRB4->BCSTR_b.INENOVF;
    if ((ISELBR29 & BIT_MASK_08) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB4OF_IrqHandler();
    }
    /* TimerB4 underflow */
    u32Tmp1 = bM0P_TMRB4->BCSTR_b.UDFF;
    u32Tmp2 = bM0P_TMRB4->BCSTR_b.INENUDF;
    if ((ISELBR29 & BIT_MASK_09) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB4UF_IrqHandler();
    }
    /* TimerB3 compare match */
    u32Tmp1 = bM0P_TMRB3->STFLR_b.CMPF1;
    u32Tmp2 = bM0P_TMRB3->ICONR_b.ITEN1;
    if ((ISELBR29 & BIT_MASK_10) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB3Cmp_IrqHandler();
    }
    /* ADC seq.B convert complete */
    u32Tmp1 = bM0P_ADC->ISR_b.EOCBF;
    u32Tmp2 = bM0P_ADC->ICR_b.EOCBIEN;
    if ((ISELBR29 & BIT_MASK_11) && (u32Tmp1) && (u32Tmp2))
    {
        AdcSeqB_IrqHandler();
    }
    /* USART2 Rx end */
    u32Tmp1 = bM0P_USART2->SR_b.RXNE;
    u32Tmp2 = bM0P_USART2->CR1_b.RIE;
    if ((ISELBR29 & BIT_MASK_12) && (u32Tmp1) && (u32Tmp2))
    {
        Usart2RxEnd_IrqHandler();
    }
    /* USART3 Tx end */
    u32Tmp1 = bM0P_USART3->SR_b.TC;
    u32Tmp2 = bM0P_USART3->CR1_b.TCIE;
    if ((ISELBR29 & BIT_MASK_13) && (u32Tmp1) && (u32Tmp2))
    {
        Usart3TxEnd_IrqHandler();
    }
    /* I2c Rx end */
    u32Tmp1 = bM0P_I2C->SR_b.RFULLF;
    u32Tmp2 = bM0P_I2C->CR2_b.RFULLIE;
    if ((ISELBR29 & BIT_MASK_14) && (u32Tmp1) && (u32Tmp2))
    {
        I2cRxEnd_IrqHandler();
    }
}

/**
 * @brief  Interrupt No.030 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ030_Handler(void)
{
    uint32_t u32Tmp1 = 0ul;
    uint32_t u32Tmp2 = 0ul;
    uint32_t ISELBR30 = M0P_INTC->ISELBR30;

    /* TimerB1 overflow */
    u32Tmp1 = bM0P_TMRB1->BCSTR_b.OVFF;
    u32Tmp2 = bM0P_TMRB1->BCSTR_b.INENOVF;
    if ((ISELBR30 & BIT_MASK_08) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB1OF_IrqHandler();
    }
    /* TimerB1 underflow */
    u32Tmp1 = bM0P_TMRB1->BCSTR_b.UDFF;
    u32Tmp2 = bM0P_TMRB1->BCSTR_b.INENUDF;
    if ((ISELBR30 & BIT_MASK_09) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB1UF_IrqHandler();
    }
    /* TimerB2 compare match */
    u32Tmp1 = bM0P_TMRB2->STFLR_b.CMPF1;
    u32Tmp2 = bM0P_TMRB2->ICONR_b.ITEN1;
    if ((ISELBR30 & BIT_MASK_10) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB2Cmp_IrqHandler();
    }
    /* ADC convert result in range of window 0 setting */
    u32Tmp1 = bM0P_ADC->AWDSR_b.AWD0F;
    u32Tmp2 = bM0P_ADC->AWDCR_b.AWD0IEN;
    if ((ISELBR30 & BIT_MASK_11) && (u32Tmp1) && (u32Tmp2))
    {
        AdcCmp0_IrqHandler();
    }
    /* USART2 Tx buffer empty */
    u32Tmp1 = bM0P_USART2->SR_b.TXE;
    u32Tmp2 = bM0P_USART2->CR1_b.TXEIE;
    if ((ISELBR30 & BIT_MASK_12) && (u32Tmp1) && (u32Tmp2))
    {
        Usart2TxEmpt_IrqHandler();
    }
    /* I2c Tx end */
    u32Tmp1 = bM0P_I2C->SR_b.TENDF;
    u32Tmp2 = bM0P_I2C->CR2_b.TENDIE;
    if ((ISELBR30 & BIT_MASK_13) && (u32Tmp1) && (u32Tmp2))
    {
        I2cTxEnd_IrqHandler();
    }
    /* USART4 Tx buffer empty */
    u32Tmp1 = bM0P_USART4->SR_b.TXE;
    u32Tmp2 = bM0P_USART4->CR1_b.TXEIE;
    if ((ISELBR30 & BIT_MASK_15) && (u32Tmp1) && (u32Tmp2))
    {
        Usart4TxEmpt_IrqHandler();
    }
}

/**
 * @brief  Interrupt No.031 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ031_Handler(void)
{
    uint32_t u32Tmp1 = 0ul;
    uint32_t u32Tmp2 = 0ul;
    uint32_t ISELBR31 = M0P_INTC->ISELBR31;

    /* LVD detected */
    if (0u == M0P_EFM->LVDICGCR_f.LVDDIS)
    {
        u32Tmp1 = bM0P_PWC->LVDCSR_b.DETF;
        if ((ISELBR31 & BIT_MASK_02) && (u32Tmp1))
        {
            Lvd_IrqHandler();
        }
    }
    /* EFM operate end */
    if (bM0P_EFM->FITE_b.OPTENDITE)
    {
        u32Tmp1 = bM0P_EFM->FSR_b.OPTEND;
        if ((ISELBR31 & BIT_MASK_04) && (u32Tmp1))
        {
            EfmOpEnd_IrqHandler();
        }
    }
    /* RTC alarm */
    u32Tmp1 = bM0P_RTC->CR2_b.ALMF;
    u32Tmp2 = bM0P_RTC->CR2_b.ALMIE;
    if ((ISELBR31 & BIT_MASK_05) && (u32Tmp1) && (u32Tmp2))
    {
        RtcAlarm_IrqHandler();
    }
    /* RTC period */
    u32Tmp1 = bM0P_RTC->CR2_b.PRDF;
    u32Tmp2 = bM0P_RTC->CR2_b.PRDIE;
    if ((ISELBR31 & BIT_MASK_06) && (u32Tmp1) && (u32Tmp2))
    {
        RtcPeriod_IrqHandler();
    }
    /* TimerB2 overflow */
    u32Tmp1 = bM0P_TMRB2->BCSTR_b.OVFF;
    u32Tmp2 = bM0P_TMRB2->BCSTR_b.INENOVF;
    if ((ISELBR31 & BIT_MASK_08) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB2OF_IrqHandler();
    }
    /* TimerB2 underflow */
    u32Tmp1 = bM0P_TMRB2->BCSTR_b.UDFF;
    u32Tmp2 = bM0P_TMRB2->BCSTR_b.INENUDF;
    if ((ISELBR31 & BIT_MASK_09) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB2UF_IrqHandler();
    }
    /* TimerB1 compare match */
    u32Tmp1 = bM0P_TMRB1->STFLR_b.CMPF1;
    u32Tmp2 = bM0P_TMRB1->ICONR_b.ITEN1;
    if ((ISELBR31 & BIT_MASK_10) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB1Cmp_IrqHandler();
    }
    if (Set == bM0P_ADC->AWDCR_b.AWD1IEN)
    {
        /* ADC convert result in range of window 1 if independence use */
        u32Tmp1 = bM0P_ADC->AWDSR_b.AWD1F;
        u32Tmp2 = M0P_ADC->AWDCR_f.AWDCM;
        if ((ISELBR31 & BIT_MASK_11) && (u32Tmp1) && (Reset == u32Tmp2))
        {
            AdcCmp1_IrqHandler();
        }
        /* ADC convert result combination use of window 0 & 1 */
        u32Tmp1 = bM0P_ADC->AWDSR_b.AWDCMF;
        if ((ISELBR31 & BIT_MASK_11) && (u32Tmp1) && (Reset != u32Tmp2))
        {
            AdcCmp1_IrqHandler();
        }
    }
    /* USART2 Tx end */
    u32Tmp1 = bM0P_USART2->SR_b.TC;
    u32Tmp2 = bM0P_USART2->CR1_b.TCIE;
    if ((ISELBR31 & BIT_MASK_12) && (u32Tmp1) && (u32Tmp2))
    {
        Usart2TxEnd_IrqHandler();
    }
    /* SPI Tx buffer empty */
    u32Tmp1 = bM0P_SPI->SR_b.TDEF;
    u32Tmp2 = bM0P_SPI->CR1_b.TXIE;
    if ((ISELBR31 & BIT_MASK_13) && (u32Tmp1) && (u32Tmp2))
    {
        SpiTxEmpt_IrqHandler();
    }
    /* USART4 Tx end */
    u32Tmp1 = bM0P_USART4->SR_b.TC;
    u32Tmp2 = bM0P_USART4->CR1_b.TCIE;
    if ((ISELBR31 & BIT_MASK_15) && (u32Tmp1) && (u32Tmp2))
    {
        Usart4TxEnd_IrqHandler();
    }
}

/**
 * @}
 */

#endif /* DDL_INTERRUPTS_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
